sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rtc.c
        if (hrtc->MspDeInitCallback == NULL)
        {
            hrtc->MspDeInitCallback = HAL_RTC_MspDeInit;
        }
    }
#else
    if (hrtc->State == HAL_RTC_STATE_RESET)
    {
        /* Allocate lock resource and initialize it */
        hrtc->Lock = HAL_UNLOCKED;

        /* Initialize RTC MSP */
        HAL_RTC_MspInit(hrtc);
    }
#endif /* (USE_HAL_RTC_REGISTER_CALLBACKS) */

    /* Set RTC state */
    hrtc->State = HAL_RTC_STATE_BUSY;

    /* Waiting for synchro */
    if (HAL_RTC_WaitForSynchro(hrtc) != HAL_OK)
    {
        /* Set RTC state */
        hrtc->State = HAL_RTC_STATE_ERROR;

        return HAL_ERROR;
    }

    /* Set Initialization mode */
    if (RTC_EnterInitMode(hrtc) != HAL_OK)
    {
        /* Set RTC state */
        hrtc->State = HAL_RTC_STATE_ERROR;

        return HAL_ERROR;
    }
    else
    {
        /* Clear Flags Bits */
        CLEAR_BIT(hrtc->Instance->CRL, (RTC_FLAG_OW | RTC_FLAG_ALRAF | RTC_FLAG_SEC));

//    if (hrtc->Init.OutPut != RTC_OUTPUTSOURCE_NONE)
//    {
//      /* Disable the selected Tamper pin */
//      CLEAR_BIT(BKP->CR, BKP_CR_TPE);
//    }

        /* Set the signal which will be routed to RTC Tamper pin*/
        MODIFY_REG(hrtc->Instance->BKP_RTCCR, (BKP_RTCCR_CCO | BKP_RTCCR_ASOE | BKP_RTCCR_ASOS), hrtc->Init.OutPut);

        if (hrtc->Init.AsynchPrediv != RTC_AUTO_1_SECOND)
        {
            /* RTC Prescaler provided directly by end-user*/
            prescaler = hrtc->Init.AsynchPrediv;
        }
        else
        {
            /* RTC Prescaler will be automatically calculated to get 1 second timebase */
            /* Get the RTCCLK frequency */
            prescaler = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_RTC);

//      /* Check that RTC clock is enabled*/
            if (prescaler == 0U)
            {
                /* Should not happen. Frequency is not available*/
                hrtc->State = HAL_RTC_STATE_ERROR;
                return HAL_ERROR;
            }
            else
            {
                /* RTC period = RTCCLK/(RTC_PR + 1) */
                prescaler = prescaler - 1U;
            }
        }

        /* Configure the RTC_PRLH / RTC_PRLL */
        MODIFY_REG(hrtc->Instance->PRLH, RTC_PRLH_PRL, (prescaler >> 16U));
        MODIFY_REG(hrtc->Instance->PRLL, RTC_PRLL_PRL, (prescaler & RTC_PRLL_PRL));

        /* Wait for synchro */
        if (RTC_ExitInitMode(hrtc) != HAL_OK)
        {
            hrtc->State = HAL_RTC_STATE_ERROR;

            return HAL_ERROR;
        }

        /* Initialize date to 1st of January 2000 */
        hrtc->DateToUpdate.Year = 0x00U;
        hrtc->DateToUpdate.Month = RTC_MONTH_JANUARY;
        hrtc->DateToUpdate.Date = 0x01U;

        /* Set RTC state */
        hrtc->State = HAL_RTC_STATE_READY;

        return HAL_OK;
    }
}

/**
  * @brief  DeInitializes the RTC peripheral
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @note   This function does not reset the RTC Backup Data registers.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_DeInit(RTC_HandleTypeDef *hrtc)
{
    /* Check input parameters */
    if (hrtc == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RTC_ALL_INSTANCE(hrtc->Instance));

    /* Set RTC state */
    hrtc->State = HAL_RTC_STATE_BUSY;

    /* Set Initialization mode */
    if (RTC_EnterInitMode(hrtc) != HAL_OK)
    {
        /* Set RTC state */
        hrtc->State = HAL_RTC_STATE_ERROR;

        /* Release Lock */
        __HAL_UNLOCK(hrtc);

        return HAL_ERROR;
    }
    else
    {
        CLEAR_REG(hrtc->Instance->CNTL);
        CLEAR_REG(hrtc->Instance->CNTH);
        WRITE_REG(hrtc->Instance->PRLL, 0x00008000U);
        CLEAR_REG(hrtc->Instance->PRLH);

        /* Reset All CRH/CRL bits */
        CLEAR_REG(hrtc->Instance->CRH);
        CLEAR_REG(hrtc->Instance->CRL);

        if (RTC_ExitInitMode(hrtc) != HAL_OK)
        {
            hrtc->State = HAL_RTC_STATE_ERROR;

            /* Process Unlocked */
            __HAL_UNLOCK(hrtc);

            return HAL_ERROR;
        }
    }

    /* Wait for synchro*/
    HAL_RTC_WaitForSynchro(hrtc);

    /* Clear RSF flag */
    CLEAR_BIT(hrtc->Instance->CRL, RTC_FLAG_RSF);

#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
    if (hrtc->MspDeInitCallback == NULL)
    {
        hrtc->MspDeInitCallback = HAL_RTC_MspDeInit;
    }

    /* DeInit the low level hardware: CLOCK, NVIC.*/
    hrtc->MspDeInitCallback(hrtc);

#else
    /* De-Initialize RTC MSP */
    HAL_RTC_MspDeInit(hrtc);
#endif /* (USE_HAL_RTC_REGISTER_CALLBACKS) */

    hrtc->State = HAL_RTC_STATE_RESET;

    /* Release Lock */
    __HAL_UNLOCK(hrtc);

    return HAL_OK;
}

#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register a User RTC Callback
  *         To be used instead of the weak predefined callback
  * @param  hrtc RTC handle
  * @param  CallbackID ID of the callback to be registered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_RTC_ALARM_A_EVENT_CB_ID          Alarm A Event Callback ID
  *          @arg @ref HAL_RTC_TAMPER1_EVENT_CB_ID          Tamper 1 Callback ID
  *          @arg @ref HAL_RTC_MSPINIT_CB_ID                Msp Init callback ID
  *          @arg @ref HAL_RTC_MSPDEINIT_CB_ID              Msp DeInit callback ID
  * @param  pCallback pointer to the Callback function
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_RegisterCallback(RTC_HandleTypeDef *hrtc, HAL_RTC_CallbackIDTypeDef CallbackID, pRTC_CallbackTypeDef pCallback)
{
    HAL_StatusTypeDef status = HAL_OK;

    if (pCallback == NULL)
    {
        return HAL_ERROR;
    }

    /* Process locked */
    __HAL_LOCK(hrtc);

    if (HAL_RTC_STATE_READY == hrtc->State)
    {
        switch (CallbackID)
        {
        case HAL_RTC_ALARM_A_EVENT_CB_ID :
            hrtc->AlarmAEventCallback = pCallback;
            break;

        case HAL_RTC_TAMPER1_EVENT_CB_ID :
            hrtc->Tamper1EventCallback = pCallback;
            break;

        case HAL_RTC_MSPINIT_CB_ID :
            hrtc->MspInitCallback = pCallback;
            break;

        case HAL_RTC_MSPDEINIT_CB_ID :
            hrtc->MspDeInitCallback = pCallback;
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (HAL_RTC_STATE_RESET == hrtc->State)
    {
        switch (CallbackID)
        {
        case HAL_RTC_MSPINIT_CB_ID :
            hrtc->MspInitCallback = pCallback;
            break;

        case HAL_RTC_MSPDEINIT_CB_ID :
            hrtc->MspDeInitCallback = pCallback;
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hrtc);

