sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rtc.c
    return status;
}

/**
  * @brief  Unregister an RTC Callback
  *         RTC callabck is redirected to the weak predefined callback
  * @param  hrtc RTC handle
  * @param  CallbackID ID of the callback to be unregistered
  *         This parameter can be one of the following values:
  *          @arg @ref HAL_RTC_ALARM_A_EVENT_CB_ID          Alarm A Event Callback ID
  *          @arg @ref HAL_RTC_TAMPER1_EVENT_CB_ID          Tamper 1 Callback ID
  *          @arg @ref HAL_RTC_MSPINIT_CB_ID Msp Init callback ID
  *          @arg @ref HAL_RTC_MSPDEINIT_CB_ID Msp DeInit callback ID
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_UnRegisterCallback(RTC_HandleTypeDef *hrtc, HAL_RTC_CallbackIDTypeDef CallbackID)
{
    HAL_StatusTypeDef status = HAL_OK;

    /* Process locked */
    __HAL_LOCK(hrtc);

    if (HAL_RTC_STATE_READY == hrtc->State)
    {
        switch (CallbackID)
        {
        case HAL_RTC_ALARM_A_EVENT_CB_ID :
            hrtc->AlarmAEventCallback = HAL_RTC_AlarmAEventCallback;         /* Legacy weak AlarmAEventCallback    */
            break;

        case HAL_RTC_TAMPER1_EVENT_CB_ID :
            hrtc->Tamper1EventCallback = HAL_RTCEx_Tamper1EventCallback;         /* Legacy weak Tamper1EventCallback   */
            break;

        case HAL_RTC_MSPINIT_CB_ID :
            hrtc->MspInitCallback = HAL_RTC_MspInit;
            break;

        case HAL_RTC_MSPDEINIT_CB_ID :
            hrtc->MspDeInitCallback = HAL_RTC_MspDeInit;
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else if (HAL_RTC_STATE_RESET == hrtc->State)
    {
        switch (CallbackID)
        {
        case HAL_RTC_MSPINIT_CB_ID :
            hrtc->MspInitCallback = HAL_RTC_MspInit;
            break;

        case HAL_RTC_MSPDEINIT_CB_ID :
            hrtc->MspDeInitCallback = HAL_RTC_MspDeInit;
            break;

        default :
            /* Return error status */
            status =  HAL_ERROR;
            break;
        }
    }
    else
    {
        /* Return error status */
        status =  HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(hrtc);

    return status;
}
#endif /* USE_HAL_RTC_REGISTER_CALLBACKS */

/**
  * @brief  Initializes the RTC MSP.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @retval None
  */
__weak void HAL_RTC_MspInit(RTC_HandleTypeDef *hrtc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hrtc);
    /* NOTE : This function Should not be modified, when the callback is needed,
              the HAL_RTC_MspInit could be implemented in the user file
     */
}

/**
  * @brief  DeInitializes the RTC MSP.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @retval None
  */
__weak void HAL_RTC_MspDeInit(RTC_HandleTypeDef *hrtc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hrtc);
    /* NOTE : This function Should not be modified, when the callback is needed,
              the HAL_RTC_MspDeInit could be implemented in the user file
     */
}

/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Group2 Time and Date functions
 *  @brief   RTC Time and Date functions
 *
@verbatim
 ===============================================================================
                 ##### RTC Time and Date functions #####
 ===============================================================================

 [..] This section provides functions allowing to configure Time and Date features

@endverbatim
  * @{
  */

/**
  * @brief  Sets RTC current time.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sTime: Pointer to Time structure
  * @param  Format: Specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *            @arg RTC_FORMAT_BIN: Binary data format
  *            @arg RTC_FORMAT_BCD: BCD data format
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_SetTime(RTC_HandleTypeDef *hrtc, RTC_TimeTypeDef *sTime, uint32_t Format)
{
    uint32_t counter_time = 0U, counter_alarm = 0U;

    /* Check input parameters */
    if ((hrtc == NULL) || (sTime == NULL))
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(Format));

    /* Process Locked */
    __HAL_LOCK(hrtc);

    hrtc->State = HAL_RTC_STATE_BUSY;

    if (Format == RTC_FORMAT_BIN)
    {
        assert_param(IS_RTC_HOUR24(sTime->Hours));
        assert_param(IS_RTC_MINUTES(sTime->Minutes));
        assert_param(IS_RTC_SECONDS(sTime->Seconds));

        counter_time = (uint32_t)(((uint32_t)sTime->Hours * 3600U) + \
                                  ((uint32_t)sTime->Minutes * 60U) + \
                                  ((uint32_t)sTime->Seconds));
    }
    else
    {
        assert_param(IS_RTC_HOUR24(RTC_Bcd2ToByte(sTime->Hours)));
        assert_param(IS_RTC_MINUTES(RTC_Bcd2ToByte(sTime->Minutes)));
        assert_param(IS_RTC_SECONDS(RTC_Bcd2ToByte(sTime->Seconds)));

        counter_time = (((uint32_t)(RTC_Bcd2ToByte(sTime->Hours)) * 3600U) + \
                        ((uint32_t)(RTC_Bcd2ToByte(sTime->Minutes)) * 60U) + \
                        ((uint32_t)(RTC_Bcd2ToByte(sTime->Seconds))));
    }

    /* Write time counter in RTC registers */
    if (RTC_WriteTimeCounter(hrtc, counter_time) != HAL_OK)
    {
        /* Set RTC state */
        hrtc->State = HAL_RTC_STATE_ERROR;

        /* Process Unlocked */
        __HAL_UNLOCK(hrtc);

        return HAL_ERROR;
    }
    else
    {
        /* Clear Second and overflow flags */
        CLEAR_BIT(hrtc->Instance->CRL, (RTC_FLAG_SEC | RTC_FLAG_OW));

        /* Read current Alarm counter in RTC registers */
        counter_alarm = RTC_ReadAlarmCounter(hrtc);

        /* Set again alarm to match with new time if enabled */
        if (counter_alarm != RTC_ALARM_RESETVALUE)
        {
            if (counter_alarm < counter_time)
            {
                /* Add 1 day to alarm counter*/
                counter_alarm += (uint32_t)(24U * 3600U);

                /* Write new Alarm counter in RTC registers */
                if (RTC_WriteAlarmCounter(hrtc, counter_alarm) != HAL_OK)
                {
                    /* Set RTC state */
                    hrtc->State = HAL_RTC_STATE_ERROR;

                    /* Process Unlocked */
                    __HAL_UNLOCK(hrtc);

                    return HAL_ERROR;
                }
            }
        }

