sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rtc.c
        hrtc->State = HAL_RTC_STATE_READY;

        __HAL_UNLOCK(hrtc);

        return HAL_OK;
    }
}

/**
  * @brief  Gets RTC current time.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sTime: Pointer to Time structure
  * @param  Format: Specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *            @arg RTC_FORMAT_BIN: Binary data format
  *            @arg RTC_FORMAT_BCD: BCD data format
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_GetTime(RTC_HandleTypeDef *hrtc, RTC_TimeTypeDef *sTime, uint32_t Format)
{
    uint32_t counter_time = 0U, counter_alarm = 0U, days_elapsed = 0U, hours = 0U;

    /* Check input parameters */
    if ((hrtc == NULL) || (sTime == NULL))
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(Format));

    /* Check if counter overflow occurred */
    if (__HAL_RTC_OVERFLOW_GET_FLAG(hrtc, RTC_FLAG_OW))
    {
        return HAL_ERROR;
    }

    /* Read the time counter*/
    counter_time = RTC_ReadTimeCounter(hrtc);

    /* Fill the structure fields with the read parameters */
    hours = counter_time / 3600U;
    sTime->Minutes  = (uint8_t)((counter_time % 3600U) / 60U);
    sTime->Seconds  = (uint8_t)((counter_time % 3600U) % 60U);

    if (hours >= 24U)
    {
        /* Get number of days elapsed from last calculation */
        days_elapsed = (hours / 24U);

        /* Set Hours in RTC_TimeTypeDef structure*/
        sTime->Hours = (hours % 24U);

        /* Read Alarm counter in RTC registers */
        counter_alarm = RTC_ReadAlarmCounter(hrtc);

        /* Calculate remaining time to reach alarm (only if set and not yet expired)*/
        if ((counter_alarm != RTC_ALARM_RESETVALUE) && (counter_alarm > counter_time))
        {
            counter_alarm -= counter_time;
        }
        else
        {
            /* In case of counter_alarm < counter_time */
            /* Alarm expiration already occurred but alarm not deactivated */
            counter_alarm = RTC_ALARM_RESETVALUE;
        }

        /* Set updated time in decreasing counter by number of days elapsed */
        counter_time -= (days_elapsed * 24U * 3600U);

        /* Write time counter in RTC registers */
        if (RTC_WriteTimeCounter(hrtc, counter_time) != HAL_OK)
        {
            return HAL_ERROR;
        }

        /* Set updated alarm to be set */
        if (counter_alarm != RTC_ALARM_RESETVALUE)
        {
            counter_alarm += counter_time;

            /* Write time counter in RTC registers */
            if (RTC_WriteAlarmCounter(hrtc, counter_alarm) != HAL_OK)
            {
                return HAL_ERROR;
            }
        }
        else
        {
            /* Alarm already occurred. Set it to reset values to avoid unexpected expiration */
            if (RTC_WriteAlarmCounter(hrtc, counter_alarm) != HAL_OK)
            {
                return HAL_ERROR;
            }
        }

        /* Update date */
        RTC_DateUpdate(hrtc, days_elapsed);
    }
    else
    {
        sTime->Hours = hours;
    }

    /* Check the input parameters format */
    if (Format != RTC_FORMAT_BIN)
    {
        /* Convert the time structure parameters to BCD format */
        sTime->Hours    = (uint8_t)RTC_ByteToBcd2(sTime->Hours);
        sTime->Minutes  = (uint8_t)RTC_ByteToBcd2(sTime->Minutes);
        sTime->Seconds  = (uint8_t)RTC_ByteToBcd2(sTime->Seconds);
    }

    return HAL_OK;
}


/**
  * @brief  Sets RTC current date.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sDate: Pointer to date structure
  * @param  Format: specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *            @arg RTC_FORMAT_BIN: Binary data format
  *            @arg RTC_FORMAT_BCD: BCD data format
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_SetDate(RTC_HandleTypeDef *hrtc, RTC_DateTypeDef *sDate, uint32_t Format)
{
    uint32_t counter_time = 0U, counter_alarm = 0U, hours = 0U;

    /* Check input parameters */
    if ((hrtc == NULL) || (sDate == NULL))
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(Format));

    /* Process Locked */
    __HAL_LOCK(hrtc);

    hrtc->State = HAL_RTC_STATE_BUSY;

    if (Format == RTC_FORMAT_BIN)
    {
        assert_param(IS_RTC_YEAR(sDate->Year));
        assert_param(IS_RTC_MONTH(sDate->Month));
        assert_param(IS_RTC_DATE(sDate->Date));

        /* Change the current date */
        hrtc->DateToUpdate.Year  = sDate->Year;
        hrtc->DateToUpdate.Month = sDate->Month;
        hrtc->DateToUpdate.Date  = sDate->Date;
    }
    else
    {
        assert_param(IS_RTC_YEAR(RTC_Bcd2ToByte(sDate->Year)));
        assert_param(IS_RTC_MONTH(RTC_Bcd2ToByte(sDate->Month)));
        assert_param(IS_RTC_DATE(RTC_Bcd2ToByte(sDate->Date)));

        /* Change the current date */
        hrtc->DateToUpdate.Year  = RTC_Bcd2ToByte(sDate->Year);
        hrtc->DateToUpdate.Month = RTC_Bcd2ToByte(sDate->Month);
        hrtc->DateToUpdate.Date  = RTC_Bcd2ToByte(sDate->Date);
    }

    /* WeekDay set by user can be ignored because automatically calculated */
    hrtc->DateToUpdate.WeekDay = RTC_WeekDayNum(hrtc->DateToUpdate.Year, hrtc->DateToUpdate.Month, hrtc->DateToUpdate.Date);
    sDate->WeekDay = hrtc->DateToUpdate.WeekDay;

    /* Reset time to be aligned on the same day */
    /* Read the time counter*/
    counter_time = RTC_ReadTimeCounter(hrtc);

    /* Fill the structure fields with the read parameters */
    hours = counter_time / 3600U;
    if (hours > 24U)
    {
        /* Set updated time in decreasing counter by number of days elapsed */
        counter_time -= ((hours / 24U) * 24U * 3600U);
        /* Write time counter in RTC registers */
        if (RTC_WriteTimeCounter(hrtc, counter_time) != HAL_OK)
        {
            /* Set RTC state */
            hrtc->State = HAL_RTC_STATE_ERROR;

            /* Process Unlocked */
            __HAL_UNLOCK(hrtc);

            return HAL_ERROR;
        }

