sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rtc.c
        /* Read current Alarm counter in RTC registers */
        counter_alarm = RTC_ReadAlarmCounter(hrtc);

        /* Set again alarm to match with new time if enabled */
        if (counter_alarm != RTC_ALARM_RESETVALUE)
        {
            if (counter_alarm < counter_time)
            {
                /* Add 1 day to alarm counter*/
                counter_alarm += (uint32_t)(24U * 3600U);

                /* Write new Alarm counter in RTC registers */
                if (RTC_WriteAlarmCounter(hrtc, counter_alarm) != HAL_OK)
                {
                    /* Set RTC state */
                    hrtc->State = HAL_RTC_STATE_ERROR;

                    /* Process Unlocked */
                    __HAL_UNLOCK(hrtc);

                    return HAL_ERROR;
                }
            }
        }


    }

    hrtc->State = HAL_RTC_STATE_READY ;

    /* Process Unlocked */
    __HAL_UNLOCK(hrtc);

    return HAL_OK;
}

/**
  * @brief  Gets RTC current date.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sDate: Pointer to Date structure
  * @param  Format: Specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *            @arg RTC_FORMAT_BIN:  Binary data format
  *            @arg RTC_FORMAT_BCD:  BCD data format
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_GetDate(RTC_HandleTypeDef *hrtc, RTC_DateTypeDef *sDate, uint32_t Format)
{
    RTC_TimeTypeDef stime = {0U};

    /* Check input parameters */
    if ((hrtc == NULL) || (sDate == NULL))
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(Format));

    /* Call HAL_RTC_GetTime function to update date if counter higher than 24 hours */
    if (HAL_RTC_GetTime(hrtc, &stime, RTC_FORMAT_BIN) != HAL_OK)
    {
        return HAL_ERROR;
    }

    /* Fill the structure fields with the read parameters */
    sDate->WeekDay  = hrtc->DateToUpdate.WeekDay;
    sDate->Year     = hrtc->DateToUpdate.Year;
    sDate->Month    = hrtc->DateToUpdate.Month;
    sDate->Date     = hrtc->DateToUpdate.Date;

    /* Check the input parameters format */
    if (Format != RTC_FORMAT_BIN)
    {
        /* Convert the date structure parameters to BCD format */
        sDate->Year   = (uint8_t)RTC_ByteToBcd2(sDate->Year);
        sDate->Month  = (uint8_t)RTC_ByteToBcd2(sDate->Month);
        sDate->Date   = (uint8_t)RTC_ByteToBcd2(sDate->Date);
    }
    return HAL_OK;
}

/**
  * @}
  */

/** @defgroup RTC_Exported_Functions_Group3 Alarm functions
 *  @brief   RTC Alarm functions
 *
@verbatim
 ===============================================================================
                 ##### RTC Alarm functions #####
 ===============================================================================

 [..] This section provides functions allowing to configure Alarm feature

@endverbatim
  * @{
  */

/**
  * @brief  Sets the specified RTC Alarm.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sAlarm: Pointer to Alarm structure
  * @param  Format: Specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *             @arg RTC_FORMAT_BIN: Binary data format
  *             @arg RTC_FORMAT_BCD: BCD data format
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_SetAlarm(RTC_HandleTypeDef *hrtc, RTC_AlarmTypeDef *sAlarm, uint32_t Format)
{
    uint32_t counter_alarm = 0U, counter_time;
    RTC_TimeTypeDef stime = {0U};

    /* Check input parameters */
    if ((hrtc == NULL) || (sAlarm == NULL))
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(Format));
    assert_param(IS_RTC_ALARM(sAlarm->Alarm));

    /* Process Locked */
    __HAL_LOCK(hrtc);

    hrtc->State = HAL_RTC_STATE_BUSY;

    /* Call HAL_RTC_GetTime function to update date if counter higher than 24 hours */
    if (HAL_RTC_GetTime(hrtc, &stime, RTC_FORMAT_BIN) != HAL_OK)
    {
        return HAL_ERROR;
    }

    /* Convert time in seconds */
    counter_time = (uint32_t)(((uint32_t)stime.Hours * 3600U) + \
                              ((uint32_t)stime.Minutes * 60U) + \
                              ((uint32_t)stime.Seconds));

    if (Format == RTC_FORMAT_BIN)
    {
        assert_param(IS_RTC_HOUR24(sAlarm->AlarmTime.Hours));
        assert_param(IS_RTC_MINUTES(sAlarm->AlarmTime.Minutes));
        assert_param(IS_RTC_SECONDS(sAlarm->AlarmTime.Seconds));

        counter_alarm = (uint32_t)(((uint32_t)sAlarm->AlarmTime.Hours * 3600U) + \
                                   ((uint32_t)sAlarm->AlarmTime.Minutes * 60U) + \
                                   ((uint32_t)sAlarm->AlarmTime.Seconds));
    }
    else
    {
        assert_param(IS_RTC_HOUR24(RTC_Bcd2ToByte(sAlarm->AlarmTime.Hours)));
        assert_param(IS_RTC_MINUTES(RTC_Bcd2ToByte(sAlarm->AlarmTime.Minutes)));
        assert_param(IS_RTC_SECONDS(RTC_Bcd2ToByte(sAlarm->AlarmTime.Seconds)));

        counter_alarm = (((uint32_t)(RTC_Bcd2ToByte(sAlarm->AlarmTime.Hours)) * 3600U) + \
                         ((uint32_t)(RTC_Bcd2ToByte(sAlarm->AlarmTime.Minutes)) * 60U) + \
                         ((uint32_t)RTC_Bcd2ToByte(sAlarm->AlarmTime.Seconds)));
    }

    /* Check that requested alarm should expire in the same day (otherwise add 1 day) */
    if (counter_alarm < counter_time)
    {
        /* Add 1 day to alarm counter*/
        counter_alarm += (uint32_t)(24U * 3600U);
    }

    /* Write Alarm counter in RTC registers */
    if (RTC_WriteAlarmCounter(hrtc, counter_alarm) != HAL_OK)
    {
        /* Set RTC state */
        hrtc->State = HAL_RTC_STATE_ERROR;

        /* Process Unlocked */
        __HAL_UNLOCK(hrtc);

        return HAL_ERROR;
    }
    else
    {
        hrtc->State = HAL_RTC_STATE_READY;

        __HAL_UNLOCK(hrtc);

        return HAL_OK;
    }
}

/**
  * @brief  Sets the specified RTC Alarm with Interrupt
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sAlarm: Pointer to Alarm structure
  * @param  Format: Specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *             @arg RTC_FORMAT_BIN: Binary data format
  *             @arg RTC_FORMAT_BCD: BCD data format
  * @note   The HAL_RTC_SetTime() must be called before enabling the Alarm feature.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_SetAlarm_IT(RTC_HandleTypeDef *hrtc, RTC_AlarmTypeDef *sAlarm, uint32_t Format)
{
    uint32_t counter_alarm = 0U, counter_time;
    RTC_TimeTypeDef stime = {0U};

    /* Check input parameters */
    if ((hrtc == NULL) || (sAlarm == NULL))
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(Format));
    assert_param(IS_RTC_ALARM(sAlarm->Alarm));

    /* Process Locked */
    __HAL_LOCK(hrtc);

