sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rtc.c
    hrtc->State = HAL_RTC_STATE_BUSY;

    /* Call HAL_RTC_GetTime function to update date if counter higher than 24 hours */
    if (HAL_RTC_GetTime(hrtc, &stime, RTC_FORMAT_BIN) != HAL_OK)
    {
        return HAL_ERROR;
    }

    /* Convert time in seconds */
    counter_time = (uint32_t)(((uint32_t)stime.Hours * 3600U) + \
                              ((uint32_t)stime.Minutes * 60U) + \
                              ((uint32_t)stime.Seconds));

    if (Format == RTC_FORMAT_BIN)
    {
        assert_param(IS_RTC_HOUR24(sAlarm->AlarmTime.Hours));
        assert_param(IS_RTC_MINUTES(sAlarm->AlarmTime.Minutes));
        assert_param(IS_RTC_SECONDS(sAlarm->AlarmTime.Seconds));

        counter_alarm = (uint32_t)(((uint32_t)sAlarm->AlarmTime.Hours * 3600U) + \
                                   ((uint32_t)sAlarm->AlarmTime.Minutes * 60U) + \
                                   ((uint32_t)sAlarm->AlarmTime.Seconds));
    }
    else
    {
        assert_param(IS_RTC_HOUR24(RTC_Bcd2ToByte(sAlarm->AlarmTime.Hours)));
        assert_param(IS_RTC_MINUTES(RTC_Bcd2ToByte(sAlarm->AlarmTime.Minutes)));
        assert_param(IS_RTC_SECONDS(RTC_Bcd2ToByte(sAlarm->AlarmTime.Seconds)));

        counter_alarm = (((uint32_t)(RTC_Bcd2ToByte(sAlarm->AlarmTime.Hours)) * 3600U) + \
                         ((uint32_t)(RTC_Bcd2ToByte(sAlarm->AlarmTime.Minutes)) * 60U) + \
                         ((uint32_t)RTC_Bcd2ToByte(sAlarm->AlarmTime.Seconds)));
    }

    /* Check that requested alarm should expire in the same day (otherwise add 1 day) */
    if (counter_alarm < counter_time)
    {
        /* Add 1 day to alarm counter*/
        counter_alarm += (uint32_t)(24U * 3600U);
    }

    /* Write alarm counter in RTC registers */
    if (RTC_WriteAlarmCounter(hrtc, counter_alarm) != HAL_OK)
    {
        /* Set RTC state */
        hrtc->State = HAL_RTC_STATE_ERROR;

        /* Process Unlocked */
        __HAL_UNLOCK(hrtc);

        return HAL_ERROR;
    }
    else
    {
        /* Clear flag alarm A */
        __HAL_RTC_ALARM_CLEAR_FLAG(hrtc, RTC_FLAG_ALRAF);

        /* Configure the Alarm interrupt */
        __HAL_RTC_ALARM_ENABLE_IT(hrtc, RTC_IT_ALRA);

        /* RTC Alarm Interrupt Configuration: EXTI configuration */
        __HAL_RTC_ALARM_EXTI_ENABLE_IT();

        __HAL_RTC_ALARM_EXTI_ENABLE_RISING_EDGE();

        hrtc->State = HAL_RTC_STATE_READY;

        __HAL_UNLOCK(hrtc);

        return HAL_OK;
    }
}

/**
  * @brief  Gets the RTC Alarm value and masks.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  sAlarm: Pointer to Date structure
  * @param  Alarm: Specifies the Alarm.
  *          This parameter can be one of the following values:
  *             @arg RTC_ALARM_A: Alarm
  * @param  Format: Specifies the format of the entered parameters.
  *          This parameter can be one of the following values:
  *             @arg RTC_FORMAT_BIN: Binary data format
  *             @arg RTC_FORMAT_BCD: BCD data format
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_GetAlarm(RTC_HandleTypeDef *hrtc, RTC_AlarmTypeDef *sAlarm, uint32_t Alarm, uint32_t Format)
{
    uint32_t counter_alarm = 0U;

    /* Prevent unused argument(s) compilation warning */
    UNUSED(Alarm);

    /* Check input parameters */
    if ((hrtc == NULL) || (sAlarm == NULL))
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    assert_param(IS_RTC_FORMAT(Format));
    assert_param(IS_RTC_ALARM(Alarm));

    /* Read Alarm counter in RTC registers */
    counter_alarm = RTC_ReadAlarmCounter(hrtc);

    /* Fill the structure with the read parameters */
    /* Set hours in a day range (between 0 to 24)*/
    sAlarm->AlarmTime.Hours   = (uint32_t)((counter_alarm / 3600U) % 24U);
    sAlarm->AlarmTime.Minutes = (uint32_t)((counter_alarm % 3600U) / 60U);
    sAlarm->AlarmTime.Seconds = (uint32_t)((counter_alarm % 3600U) % 60U);

    if (Format != RTC_FORMAT_BIN)
    {
        sAlarm->AlarmTime.Hours   = RTC_ByteToBcd2(sAlarm->AlarmTime.Hours);
        sAlarm->AlarmTime.Minutes = RTC_ByteToBcd2(sAlarm->AlarmTime.Minutes);
        sAlarm->AlarmTime.Seconds = RTC_ByteToBcd2(sAlarm->AlarmTime.Seconds);
    }

    return HAL_OK;
}

/**
  * @brief  Deactive the specified RTC Alarm
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  Alarm: Specifies the Alarm.
  *          This parameter can be one of the following values:
  *            @arg RTC_ALARM_A:  AlarmA
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_DeactivateAlarm(RTC_HandleTypeDef *hrtc, uint32_t Alarm)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(Alarm);

    /* Check the parameters */
    assert_param(IS_RTC_ALARM(Alarm));

    /* Check input parameters */
    if (hrtc == NULL)
    {
        return HAL_ERROR;
    }

    /* Process Locked */
    __HAL_LOCK(hrtc);

    hrtc->State = HAL_RTC_STATE_BUSY;

    /* In case of interrupt mode is used, the interrupt source must disabled */
    __HAL_RTC_ALARM_DISABLE_IT(hrtc, RTC_IT_ALRA);

    /* Set Initialization mode */
    if (RTC_EnterInitMode(hrtc) != HAL_OK)
    {
        /* Set RTC state */
        hrtc->State = HAL_RTC_STATE_ERROR;

        /* Process Unlocked */
        __HAL_UNLOCK(hrtc);

        return HAL_ERROR;
    }
    else
    {
        /* Clear flag alarm A */
        __HAL_RTC_ALARM_CLEAR_FLAG(hrtc, RTC_FLAG_ALRAF);

        /* Set to default values ALRH & ALRL registers */
        WRITE_REG(hrtc->Instance->ALRH, RTC_ALARM_RESETVALUE_REGISTER);
        WRITE_REG(hrtc->Instance->ALRL, RTC_ALARM_RESETVALUE_REGISTER);

        /* RTC Alarm Interrupt Configuration: Disable EXTI configuration */
        __HAL_RTC_ALARM_EXTI_DISABLE_IT();

        /* Wait for synchro */
        if (RTC_ExitInitMode(hrtc) != HAL_OK)
        {
            hrtc->State = HAL_RTC_STATE_ERROR;

            /* Process Unlocked */
            __HAL_UNLOCK(hrtc);

            return HAL_ERROR;
        }
    }
    hrtc->State = HAL_RTC_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(hrtc);

    return HAL_OK;
}

/**
  * @brief  This function handles Alarm interrupt request.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @retval None
  */
void HAL_RTC_AlarmIRQHandler(RTC_HandleTypeDef *hrtc)
{
    if (__HAL_RTC_ALARM_GET_IT_SOURCE(hrtc, RTC_IT_ALRA))
    {
        /* Get the status of the Interrupt */
        if (__HAL_RTC_ALARM_GET_FLAG(hrtc, RTC_FLAG_ALRAF) != (uint32_t)RESET)
        {
            /* AlarmA callback */
#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
            hrtc->AlarmAEventCallback(hrtc);
#else
            HAL_RTC_AlarmAEventCallback(hrtc);
#endif /* USE_HAL_RTC_REGISTER_CALLBACKS */

            /* Clear the Alarm interrupt pending bit */
            __HAL_RTC_ALARM_CLEAR_FLAG(hrtc, RTC_FLAG_ALRAF);
        }
    }

    /* Clear the EXTI's line Flag for RTC Alarm */
    __HAL_RTC_ALARM_EXTI_CLEAR_FLAG();

    /* Change RTC state */
    hrtc->State = HAL_RTC_STATE_READY;
}

/**
  * @brief  Alarm A callback.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @retval None
  */
__weak void HAL_RTC_AlarmAEventCallback(RTC_HandleTypeDef *hrtc)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(hrtc);
    /* NOTE : This function Should not be modified, when the callback is needed,
              the HAL_RTC_AlarmAEventCallback could be implemented in the user file
     */
}

/**
  * @brief  This function handles AlarmA Polling request.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  Timeout: Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_RTC_PollForAlarmAEvent(RTC_HandleTypeDef *hrtc, uint32_t Timeout)
{
    uint32_t tickstart = HAL_GetTick();

    /* Check input parameters */
    if (hrtc == NULL)
    {
        return HAL_ERROR;
    }

