sh-lyf/XenD101_HPS/Driver/py32f003/PY32F003_HAL_Driver/Src/py32f003_hal_rtc.c
        /* Wait for synchro */
        if (RTC_ExitInitMode(hrtc) != HAL_OK)
        {
            status = HAL_ERROR;
        }
    }

    return status;
}

/**
  * @brief  Enters the RTC Initialization mode.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @retval HAL status
  */
static HAL_StatusTypeDef RTC_EnterInitMode(RTC_HandleTypeDef *hrtc)
{
    uint32_t tickstart = 0U;

    tickstart = HAL_GetTick();
    /* Wait till RTC is in INIT state and if Time out is reached exit */
    while ((hrtc->Instance->CRL & RTC_CRL_RTOFF) == (uint32_t)RESET)
    {
        if ((HAL_GetTick() - tickstart) >  RTC_TIMEOUT_VALUE)
        {
            return HAL_TIMEOUT;
        }
    }

    /* Disable the write protection for RTC registers */
    __HAL_RTC_WRITEPROTECTION_DISABLE(hrtc);


    return HAL_OK;
}

/**
  * @brief  Exit the RTC Initialization mode.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @retval HAL status
  */
static HAL_StatusTypeDef RTC_ExitInitMode(RTC_HandleTypeDef *hrtc)
{
    uint32_t tickstart = 0U;

    /* Disable the write protection for RTC registers */
    __HAL_RTC_WRITEPROTECTION_ENABLE(hrtc);

    tickstart = HAL_GetTick();
    /* Wait till RTC is in INIT state and if Time out is reached exit */
    while ((hrtc->Instance->CRL & RTC_CRL_RTOFF) == (uint32_t)RESET)
    {
        if ((HAL_GetTick() - tickstart) >  RTC_TIMEOUT_VALUE)
        {
            return HAL_TIMEOUT;
        }
    }

    return HAL_OK;
}

/**
  * @brief  Converts a 2 digit decimal to BCD format.
  * @param  Value: Byte to be converted
  * @retval Converted byte
  */
static uint8_t RTC_ByteToBcd2(uint8_t Value)
{
    uint32_t bcdhigh = 0U;

    while (Value >= 10U)
    {
        bcdhigh++;
        Value -= 10U;
    }

    return ((uint8_t)(bcdhigh << 4U) | Value);
}

/**
  * @brief  Converts from 2 digit BCD to Binary.
  * @param  Value: BCD value to be converted
  * @retval Converted word
  */
static uint8_t RTC_Bcd2ToByte(uint8_t Value)
{
    uint32_t tmp = 0U;
    tmp = ((uint8_t)(Value & (uint8_t)0xF0) >> (uint8_t)0x4) * 10U;
    return (tmp + (Value & (uint8_t)0x0F));
}

/**
  * @brief  Updates date when time is 23:59:59.
  * @param  hrtc   pointer to a RTC_HandleTypeDef structure that contains
  *                the configuration information for RTC.
  * @param  DayElapsed: Number of days elapsed from last date update
  * @retval None
  */
static void RTC_DateUpdate(RTC_HandleTypeDef *hrtc, uint32_t DayElapsed)
{
    uint32_t year = 0U, month = 0U, day = 0U;
    uint32_t loop = 0U;

    /* Get the current year*/
    year = hrtc->DateToUpdate.Year;

    /* Get the current month and day */
    month = hrtc->DateToUpdate.Month;
    day = hrtc->DateToUpdate.Date;

    for (loop = 0U; loop < DayElapsed; loop++)
    {
        if ((month == 1U) || (month == 3U) || (month == 5U) || (month == 7U) || \
                (month == 8U) || (month == 10U) || (month == 12U))
        {
            if (day < 31U)
            {
                day++;
            }
            /* Date structure member: day = 31 */
            else
            {
                if (month != 12U)
                {
                    month++;
                    day = 1U;
                }
                /* Date structure member: day = 31 & month =12 */
                else
                {
                    month = 1U;
                    day = 1U;
                    year++;
                }
            }
        }
        else if ((month == 4U) || (month == 6U) || (month == 9U) || (month == 11U))
        {
            if (day < 30U)
            {
                day++;
            }
            /* Date structure member: day = 30 */
            else
            {
                month++;
                day = 1U;
            }
        }
        else if (month == 2U)
        {
            if (day < 28U)
            {
                day++;
            }
            else if (day == 28U)
            {
                /* Leap year */
                if (RTC_IsLeapYear(year))
                {
                    day++;
                }
                else
                {
                    month++;
                    day = 1U;
                }
            }
            else if (day == 29U)
            {
                month++;
                day = 1U;
            }
        }
    }

    /* Update year */
    hrtc->DateToUpdate.Year = year;

    /* Update day and month */
    hrtc->DateToUpdate.Month = month;
    hrtc->DateToUpdate.Date = day;

    /* Update day of the week */
    hrtc->DateToUpdate.WeekDay = RTC_WeekDayNum(year, month, day);
}

/**
  * @brief  Check whether the passed year is Leap or not.
  * @param  nYear  year to check
  * @retval 1: leap year
  *         0: not leap year
  */
static uint8_t RTC_IsLeapYear(uint16_t nYear)
{
    if ((nYear % 4U) != 0U)
    {
        return 0U;
    }

    if ((nYear % 100U) != 0U)
    {
        return 1U;
    }

    if ((nYear % 400U) == 0U)
    {
        return 1U;
    }
    else
    {
        return 0U;
    }
}

/**
  * @brief  Determines the week number, the day number and the week day number.
  * @param  nYear   year to check
  * @param  nMonth  Month to check
  * @param  nDay    Day to check
  * @note   Day is calculated with hypothesis that year > 2000
  * @retval Value which can take one of the following parameters:
  *         @arg RTC_WEEKDAY_MONDAY
  *         @arg RTC_WEEKDAY_TUESDAY
  *         @arg RTC_WEEKDAY_WEDNESDAY
  *         @arg RTC_WEEKDAY_THURSDAY
  *         @arg RTC_WEEKDAY_FRIDAY
  *         @arg RTC_WEEKDAY_SATURDAY
  *         @arg RTC_WEEKDAY_SUNDAY
  */
static uint8_t RTC_WeekDayNum(uint32_t nYear, uint8_t nMonth, uint8_t nDay)
{
    uint32_t year = 0U, weekday = 0U;

    year = 2000U + nYear;

    if (nMonth < 3U)
    {
        /*D = { [(23 x month)/9] + day + 4 + year + [(year-1)/4] - [(year-1)/100] + [(year-1)/400] } mod 7*/
        weekday = (((23U * nMonth) / 9U) + nDay + 4U + year + ((year - 1U) / 4U) - ((year - 1U) / 100U) + ((year - 1U) / 400U)) % 7U;
    }
    else
    {
        /*D = { [(23 x month)/9] + day + 4 + year + [year/4] - [year/100] + [year/400] - 2 } mod 7*/
        weekday = (((23U * nMonth) / 9U) + nDay + 4U + year + (year / 4U) - (year / 100U) + (year / 400U) - 2U) % 7U;
    }

    return (uint8_t)weekday;
}

/**
  * @}
  */

#endif /* HAL_RTC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT Puya Semiconductor *****END OF FILE****/
